Repository: LittleSixNine/PhotoTrail
Catalog: Sources/PhotoTrail/Localizable.xcstrings
Source language: en
Languages: es, ja, ko, pt_br, zh_hans, zh_hant

# 无法暂存：请检查输入或重新读取元数据。
source: Unable to stage changes. Check the input or reload metadata.
es: No se pueden preparar los cambios. Revisa los datos o vuelve a leer los metadatos.
ja: 変更を保持できません。入力を確認するか、メタデータを再読み込みしてください。
ko: 변경을 보관하지 못했습니다. 입력을 확인하거나 메타데이터를 다시 읽으세요.
pt_br: Não foi possível preparar as alterações. Verifique os dados ou recarregue os metadados.
zh_hans: 无法暂存：请检查输入或重新读取元数据。
zh_hant: 無法暫存：請檢查輸入或重新讀取中繼資料。

# %1$@ 张照片无法编辑，将跳过。
source: Photos that cannot be edited will be skipped: %1$@.
es: Se omitirán %1$@ fotos que no se pueden editar.
ja: 編集できない%1$@枚の写真はスキップされます。
ko: 편집할 수 없는 사진 %1$@장을 건너뜁니다.
pt_br: Serão ignoradas %1$@ fotos que não podem ser editadas.
zh_hans: %1$@ 张照片无法编辑，将跳过。
zh_hant: %1$@ 張照片無法編輯，將略過。

# %1$@ 张缺少定位 · %2$@ 张已有定位
source: Without location: %1$@ · With location: %2$@
es: Sin ubicación: %1$@ · Con ubicación: %2$@
ja: 位置なし：%1$@枚 · 位置あり：%2$@枚
ko: 위치 없음: %1$@장 · 위치 있음: %2$@장
pt_br: Sem localização: %1$@ · Com localização: %2$@
zh_hans: %1$@ 张缺少定位 · %2$@ 张已有定位
zh_hant: %1$@ 張缺少定位 · %2$@ 張已有定位

# 上方仅预览当前照片
source: Only the current photo is previewed above
es: Arriba solo se muestra la foto actual
ja: 上には現在の写真のみを表示しています
ko: 위에는 현재 사진만 표시됩니다
pt_br: Acima, apenas a foto atual é exibida
zh_hans: 上方仅预览当前照片
zh_hant: 上方僅預覽目前照片

# 仅供查看：缺少轨迹点时间
source: View only: track points have no timestamps
es: Solo visualización: los puntos no tienen hora
ja: 表示のみ：軌跡点の時刻がありません
ko: 보기 전용: 경로 지점에 시간 정보 없음
pt_br: Apenas visualização: pontos sem horário
zh_hans: 仅供查看：缺少轨迹点时间
zh_hant: 僅供檢視：缺少軌跡點時間

# 仅控制地图显示，不改变匹配范围。
source: Only controls map visibility; the matching scope stays the same.
es: Solo controla la visibilidad en el mapa; no cambia el alcance de asociación.
ja: 地図上の表示のみを変更し、照合範囲は変わりません。
ko: 지도 표시만 제어하며 매칭 범위는 바뀌지 않습니다.
pt_br: Controla apenas a exibição no mapa; o escopo da associação não muda.
zh_hans: 仅控制地图显示，不改变匹配范围。
zh_hant: 僅控制地圖顯示，不改變比對範圍。

# 仍有未保存修改，未执行重命名。请检查保存结果后重试。
source: Some changes remain unsaved. No files were renamed. Check the save results and try again.
es: Quedan cambios sin guardar. No se ha renombrado ningún archivo. Revisa el resultado e inténtalo de nuevo.
ja: 未保存の変更があるため、名前は変更していません。保存結果を確認して再試行してください。
ko: 저장하지 못한 변경 사항이 있어 이름을 변경하지 않았습니다. 저장 결과를 확인한 뒤 다시 시도하세요.
pt_br: Ainda há alterações não salvas. Nenhum arquivo foi renomeado. Confira o resultado e tente novamente.
zh_hans: 仍有未保存修改，未执行重命名。请检查保存结果后重试。
zh_hant: 仍有未儲存修改，未執行重新命名。請檢查儲存結果後重試。

# 从常用方案开始
source: Start with a common recipe
es: Empezar con una opción habitual
ja: よく使う設定から開始
ko: 자주 쓰는 방식으로 시작
pt_br: Começar com uma opção comum
zh_hans: 从常用方案开始
zh_hant: 從常用方案開始

# 以下轨迹未能导入
source: These tracks could not be imported
es: No se pudieron importar estos recorridos
ja: 次の軌跡を読み込めませんでした
ko: 다음 경로를 가져오지 못했습니다
pt_br: Não foi possível importar estes trajetos
zh_hans: 以下轨迹未能导入
zh_hant: 以下軌跡未能匯入

# 使用轨迹为所选照片匹配位置
source: Match selected photos to tracks
es: Asignar ubicación a las fotos seleccionadas mediante recorridos
ja: 選択した写真を軌跡と照合
ko: 선택한 사진을 경로와 매칭
pt_br: Localizar as fotos selecionadas usando trajetos
zh_hans: 使用轨迹为所选照片匹配位置
zh_hant: 使用軌跡為所選照片比對位置

# 保存两页全部修改
source: Save both tabs
es: Guardar ambas pestañas
ja: 両タブの変更を保存
ko: 두 탭 모두 저장
pt_br: Salvar ambas as abas
zh_hans: 保存两页全部修改
zh_hant: 儲存兩頁全部修改

# 保存元数据编辑和地图定位两个页面的全部待保存修改，不限当前页或选中的照片。
source: Save all pending metadata and map location changes, regardless of the current page or selected photos.
es: Guarda todos los cambios pendientes de metadatos y ubicación, sin limitarse a la página actual ni a las fotos seleccionadas.
ja: 現在のページや選択した写真に関係なく、メタデータと地図の位置情報の未保存の変更をすべて保存します。
ko: 현재 페이지나 선택한 사진에 관계없이 메타데이터와 지도 위치의 모든 미저장 변경 사항을 저장합니다.
pt_br: Salva todas as alterações pendentes de metadados e localização, independentemente da página atual ou das fotos selecionadas.
zh_hans: 保存元数据编辑和地图定位两个页面的全部待保存修改，不限当前页或选中的照片。
zh_hant: 儲存中繼資料編輯和地圖定位兩個頁面的所有待儲存修改，不限目前頁面或選取的照片。

# 保存全部 %1$@ 项修改？
source: Save all %1$@ pending items?
es: ¿Guardar todos los elementos pendientes (%1$@)?
ja: 未保存の %1$@ 件をすべて保存しますか？
ko: 미저장 항목 %1$@개를 모두 저장할까요?
pt_br: Salvar todos os itens pendentes (%1$@)?
zh_hans: 保存全部 %1$@ 项修改？
zh_hant: 儲存全部 %1$@ 項修改？

# 保存全部修改并重新预览
source: Save all changes and refresh preview
es: Guardar todo y actualizar vista previa
ja: すべて保存してプレビューを更新
ko: 모두 저장하고 미리보기 새로 고침
pt_br: Salvar tudo e atualizar prévia
zh_hans: 保存全部修改并重新预览
zh_hant: 儲存全部修改並重新預覽

# 保存照片修改前，先为原照片留一份备份。
source: Keep a backup of the originals before saving photo changes.
es: Haz una copia de los originales antes de guardar cambios en las fotos.
ja: 写真の変更を保存する前に、元の写真をバックアップしてください。
ko: 사진 변경 사항을 저장하기 전에 원본을 백업하세요.
pt_br: Faça uma cópia dos originais antes de salvar alterações nas fotos.
zh_hans: 保存照片修改前，先为原照片留一份备份。
zh_hant: 儲存照片修改前，先為原照片留一份備份。

# 保留原名加前缀
source: Add a prefix to the original name
es: Añadir prefijo al nombre original
ja: 元の名前に接頭辞を追加
ko: 기존 이름 앞에 텍스트 추가
pt_br: Adicionar prefixo ao nome original
zh_hans: 保留原名加前缀
zh_hant: 保留原名加前綴

# 元数据和定位修改统一手动保存；重命名在确认执行后改名。三个页签可独立使用。
source: Metadata and location changes share manual saving. Renaming changes filenames after confirmation. Each tab can be used independently.
es: Los cambios de metadatos y ubicación se guardan juntos manualmente. Los nombres cambian tras confirmar. Cada pestaña se puede usar por separado.
ja: メタデータと位置情報の変更はまとめて手動保存します。名前は実行を確認した後に変更されます。各タブは独立して使えます。
ko: 메타데이터와 위치 변경 사항은 함께 수동 저장합니다. 이름 변경은 실행 확인 후 적용됩니다. 각 탭은 독립적으로 사용할 수 있습니다.
pt_br: As alterações de metadados e localização são salvas juntas manualmente. Os nomes mudam após a confirmação. Cada aba pode ser usada separadamente.
zh_hans: 元数据和定位修改统一手动保存；重命名在确认执行后改名。三个页签可独立使用。
zh_hant: 中繼資料和定位修改統一手動儲存；重新命名在確認執行後改名。三個分頁可獨立使用。

# 元数据或定位修改尚未保存。
source: Metadata or location changes are not yet saved.
es: Hay cambios de metadatos o ubicación sin guardar.
ja: メタデータまたは位置情報の変更が未保存です。
ko: 메타데이터 또는 위치 변경 사항이 아직 저장되지 않았습니다.
pt_br: Há alterações de metadados ou localização não salvas.
zh_hans: 元数据或定位修改尚未保存。
zh_hant: 中繼資料或定位修改尚未儲存。

# 先保存…
source: Save first…
es: Guardar primero…
ja: 先に保存…
ko: 먼저 저장…
pt_br: Salvar primeiro…
zh_hans: 先保存…
zh_hant: 先儲存…

# 先保存元数据，再重命名？
source: Save metadata before renaming?
es: ¿Guardar metadatos antes de renombrar?
ja: 名前の変更前にメタデータを保存しますか？
ko: 이름을 변경하기 전에 메타데이터를 저장할까요?
pt_br: Salvar metadados antes de renomear?
zh_hans: 先保存元数据，再重命名？
zh_hant: 先儲存中繼資料，再重新命名？

# 全局待保存：%1$@ 项
source: Pending across all pages: %1$@
es: Pendientes en todas las páginas: %1$@
ja: 全ページの未保存項目：%1$@ 件
ko: 전체 페이지의 미저장 항목: %1$@개
pt_br: Pendentes em todas as páginas: %1$@
zh_hans: 全局待保存：%1$@ 项
zh_hant: 全域待儲存：%1$@ 項

# 全部修改已保存。请核对更新后的文件名预览，再执行重命名。
source: All changes are saved. Review the updated filename preview before renaming.
es: Todos los cambios se han guardado. Revisa la vista previa actualizada antes de renombrar.
ja: すべての変更を保存しました。更新されたファイル名のプレビューを確認してから実行してください。
ko: 모든 변경 사항을 저장했습니다. 갱신된 파일명 미리보기를 확인한 뒤 이름을 변경하세요.
pt_br: Todas as alterações foram salvas. Confira a prévia atualizada antes de renomear.
zh_hans: 全部修改已保存。请核对更新后的文件名预览，再执行重命名。
zh_hant: 全部修改已儲存。請核對更新後的檔名預覽，再執行重新命名。

# 写入所有元数据
source: Write all metadata
es: Escribir todos los metadatos
ja: すべてのメタデータを書き込む
ko: 모든 메타데이터 기록
pt_br: Gravar todos os metadados
zh_hans: 写入所有元数据
zh_hant: 寫入所有中繼資料

# 包含元数据与地图定位的全部修改
source: Includes all metadata and map changes
es: Incluye todos los cambios de metadatos y mapa
ja: メタデータと地図の変更をすべて含む
ko: 메타데이터와 지도의 모든 변경 포함
pt_br: Inclui todas as alterações de metadados e mapa
zh_hans: 包含元数据与地图定位的全部修改
zh_hant: 包含中繼資料與地圖定位的全部修改

# 匹配后暂存，可撤销。
source: Matched changes remain pending and can be undone.
es: Los cambios quedan pendientes y se pueden deshacer.
ja: 照合後の変更は未保存で、取り消せます。
ko: 매칭한 변경 사항은 임시 저장되며 실행 취소할 수 있습니다.
pt_br: As alterações ficam pendentes e podem ser desfeitas.
zh_hans: 匹配后暂存，可撤销。
zh_hant: 比對後暫存，可復原。

# 匹配所选照片：%1$@ 张
source: Photos to match: %1$@
es: Fotos para asociar: %1$@
ja: 照合する選択写真：%1$@枚
ko: 위치를 매칭할 사진: %1$@장
pt_br: Fotos para associar: %1$@
zh_hans: 匹配所选照片：%1$@ 张
zh_hant: 比對所選照片：%1$@ 張

# 匹配范围：含时间轨迹（%1$@ 条）
source: Matching scope: tracks with timestamps (%1$@)
es: Ámbito: recorridos con marcas de tiempo (%1$@)
ja: 照合範囲：時刻付き軌跡（%1$@ 件）
ko: 매칭 범위: 시간이 있는 경로(%1$@개)
pt_br: Escopo: trajetos com horários (%1$@)
zh_hans: 匹配范围：含时间轨迹（%1$@ 条）
zh_hant: 比對範圍：含時間軌跡（%1$@ 條）

# 含时间，可匹配照片
source: Includes timestamps for photo matching
es: Con horarios: permite localizar fotos
ja: 時刻あり・写真を照合可能
ko: 시간 있음 · 사진 매칭 가능
pt_br: Com horários: permite localizar fotos
zh_hans: 含时间，可匹配照片
zh_hant: 含時間，可比對照片

# 坐标详情
source: Coordinate Details
es: Detalles de coordenadas
ja: 座標の詳細
ko: 좌표 세부 정보
pt_br: Detalhes das coordenadas
zh_hans: 坐标详情
zh_hant: 座標詳情

# 字段编辑帮助
source: Field editing help
es: Ayuda para editar campos
ja: 項目編集のヘルプ
ko: 필드 편집 도움말
pt_br: Ajuda para editar campos
zh_hans: 字段编辑帮助
zh_hant: 欄位編輯說明

# 字段范围
source: Field scope
es: Alcance de campos
ja: フィールドの範囲
ko: 필드 범위
pt_br: Escopo dos campos
zh_hans: 字段范围
zh_hant: 欄位範圍

# 完整字段
source: All fields
es: Todos los campos
ja: すべての項目
ko: 전체 필드
pt_br: Todos os campos
zh_hans: 完整字段
zh_hant: 完整欄位

# 定位修改已暂存，请写入所有元数据。
source: Location changes are pending. Use Write All Metadata to save them.
es: Los cambios de ubicación están pendientes. Usa Escribir todos los metadatos para guardarlos.
ja: 位置の変更は未保存です。「すべてのメタデータを書き込む」で保存してください。
ko: 위치 변경이 임시 저장되었습니다. 모든 메타데이터 쓰기로 저장하세요.
pt_br: As alterações de localização estão pendentes. Use Gravar todos os metadados para salvá-las.
zh_hans: 定位修改已暂存，请写入所有元数据。
zh_hant: 定位修改已暫存，請寫入所有中繼資料。

# 定位修改待写入：%1$@ 张
source: Location changes to write: %1$@ photos
es: Cambios de ubicación pendientes: %1$@ fotos
ja: 位置変更の書き込み待ち：%1$@枚
ko: 위치 변경 저장 대기: %1$@장
pt_br: Alterações de localização pendentes: %1$@ fotos
zh_hans: 定位修改待写入：%1$@ 张
zh_hant: 定位修改待寫入：%1$@ 張

# 导入 GPX、KML、KMZ，或从历史记录加入轨迹。
source: Import GPX, KML or KMZ, or add a track from history.
es: Importa GPX, KML o KMZ, o añade un recorrido del historial.
ja: GPX・KML・KMZ を読み込むか、履歴から軌跡を追加します。
ko: GPX, KML, KMZ를 가져오거나 기록에서 경로를 추가하세요.
pt_br: Importe GPX, KML ou KMZ, ou adicione um trajeto do histórico.
zh_hans: 导入 GPX、KML、KMZ，或从历史记录加入轨迹。
zh_hant: 匯入 GPX、KML、KMZ，或從歷史記錄加入軌跡。

# 导入…
source: Import…
es: Importar…
ja: 読み込む…
ko: 가져오기…
pt_br: Importar…
zh_hans: 导入…
zh_hant: 匯入…

# 导入或拖入照片，即可编辑元数据、添加拍摄地点或批量重命名。
source: Import or drag in photos to edit metadata, add locations, or rename files in batches.
es: Importa o arrastra fotos para editar metadatos, añadir ubicaciones o renombrar por lotes.
ja: 写真を読み込むかドラッグして、メタデータの編集、撮影場所の追加、一括リネームを始めましょう。
ko: 사진을 가져오거나 끌어 놓아 메타데이터 편집, 촬영 위치 추가, 일괄 이름 변경을 시작하세요.
pt_br: Importe ou arraste fotos para editar metadados, adicionar locais ou renomear em lote.
zh_hans: 导入或拖入照片，即可编辑元数据、添加拍摄地点或批量重命名。
zh_hant: 匯入或拖入照片，即可編輯中繼資料、新增拍攝地點或批次重新命名。

# 导入照片 → 选择功能 → 检查结果
source: Import photos → Choose a task → Review results
es: Importar fotos → Elegir tarea → Revisar resultados
ja: 写真を読み込む → 機能を選ぶ → 結果を確認
ko: 사진 가져오기 → 기능 선택 → 결과 확인
pt_br: Importar fotos → Escolher tarefa → Conferir resultados
zh_hans: 导入照片 → 选择功能 → 检查结果
zh_hant: 匯入照片 → 選擇功能 → 檢查結果

# 导入照片，开始整理
source: Import photos to get started
es: Importar fotos para empezar
ja: 写真を読み込んで整理を開始
ko: 사진을 가져와 정리 시작
pt_br: Importar fotos para começar
zh_hans: 导入照片，开始整理
zh_hant: 匯入照片，開始整理

# 导入轨迹
source: Import tracks
es: Importar recorridos
ja: 軌跡を読み込む
ko: 경로 가져오기
pt_br: Importar trajetos
zh_hans: 导入轨迹
zh_hant: 匯入軌跡

# 已修改 %1$@ 张照片，另有 %2$@ 张跳过；请写入所有元数据。
source: Updated %1$@ photos; skipped %2$@. Use Write All Metadata to save.
es: Se modificaron %1$@ fotos y se omitieron %2$@. Usa Escribir todos los metadatos para guardar.
ja: %1$@枚を変更し、%2$@枚をスキップしました。すべてのメタデータを書き込んで保存してください。
ko: %1$@장을 변경하고 %2$@장을 건너뛰었습니다. 모든 메타데이터 쓰기로 저장하세요.
pt_br: %1$@ fotos alteradas e %2$@ ignoradas. Use Gravar todos os metadados para salvar.
zh_hans: 已修改 %1$@ 张照片，另有 %2$@ 张跳过；请写入所有元数据。
zh_hant: 已修改 %1$@ 張照片，另有 %2$@ 張略過；請寫入所有中繼資料。

# 已选 %1$@ 张
source: Selected: %1$@
es: Selección: %1$@
ja: %1$@枚選択中
ko: %1$@장 선택됨
pt_br: Selecionadas: %1$@
zh_hans: 已选 %1$@ 张
zh_hant: 已選 %1$@ 張

# 已隐藏
source: Hidden
es: Oculto
ja: 非表示
ko: 숨겨짐
pt_br: Oculto
zh_hans: 已隐藏
zh_hant: 已隱藏

# 常用字段
source: Common fields
es: Campos habituales
ja: よく使うフィールド
ko: 자주 쓰는 필드
pt_br: Campos comuns
zh_hans: 常用字段
zh_hant: 常用欄位

# 当前照片的位置
source: Current Photo Location
es: Ubicación de la foto actual
ja: 現在の写真の位置
ko: 현재 사진의 위치
pt_br: Localização da foto atual
zh_hans: 当前照片的位置
zh_hant: 目前照片的位置

# 当前预览
source: Current Preview
es: Vista previa actual
ja: 現在のプレビュー
ko: 현재 미리보기
pt_br: Prévia atual
zh_hans: 当前预览
zh_hant: 目前預覽

# 所选照片中有 %1$@ 张不支持这些字段的编辑。请选择 JPEG 或已有 XMP 后重试。
source: These fields cannot be edited for %1$@ selected photos. Select JPEG files or existing XMP sidecars and try again.
es: Estas propiedades no se pueden editar en %1$@ fotos seleccionadas. Selecciona archivos JPEG o XMP existentes.
ja: 選択した写真のうち %1$@ 枚では、これらのフィールドを編集できません。JPEG または既存の XMP を選択してください。
ko: 선택한 사진 %1$@장은 이 필드를 편집할 수 없습니다. JPEG 또는 기존 XMP를 선택한 뒤 다시 시도하세요.
pt_br: Não é possível editar estes campos em %1$@ fotos selecionadas. Selecione arquivos JPEG ou XMP existentes.
zh_hans: 所选照片中有 %1$@ 张不支持这些字段的编辑。请选择 JPEG 或已有 XMP 后重试。
zh_hant: 所選照片中有 %1$@ 張不支援這些欄位的編輯。請選擇 JPEG 或已有 XMP 後重試。

# 所选照片中有 %1$@ 张存在未保存的日期或定位修改，请先保存全部修改。
source: There are unsaved date or location changes in %1$@ selected photos. Save all changes first.
es: Hay cambios de fecha o ubicación sin guardar en %1$@ fotos seleccionadas. Guarda todo primero.
ja: 選択した写真のうち %1$@ 枚に、日時または位置情報の未保存の変更があります。先にすべて保存してください。
ko: 선택한 사진 %1$@장에 저장하지 않은 날짜 또는 위치 변경 사항이 있습니다. 먼저 모든 변경 사항을 저장하세요.
pt_br: Há alterações de data ou localização não salvas em %1$@ fotos selecionadas. Salve tudo primeiro.
zh_hans: 所选照片中有 %1$@ 张存在未保存的日期或定位修改，请先保存全部修改。
zh_hant: 所選照片中有 %1$@ 張存在未儲存的日期或定位修改，請先儲存全部修改。

# 所选照片包含无法编辑的项目，应用收藏前请调整选择。
source: Some selected photos cannot be edited. Adjust the selection before applying a favorite.
es: Hay fotos seleccionadas que no se pueden editar. Ajusta la selección antes de aplicar un favorito.
ja: 編集できない写真が含まれています。お気に入りを適用する前に選択を変更してください。
ko: 편집할 수 없는 사진이 포함되어 있습니다. 즐겨찾기를 적용하기 전에 선택을 변경하세요.
pt_br: Algumas fotos selecionadas não podem ser editadas. Ajuste a seleção antes de aplicar um favorito.
zh_hans: 所选照片包含无法编辑的项目，应用收藏前请调整选择。
zh_hant: 所選照片包含無法編輯的項目，套用收藏前請調整選擇。

# 所选照片均已有定位，可在更多匹配选项中重新匹配。
source: All selected photos have locations. Use More Matching Options to match them again.
es: Todas las fotos seleccionadas tienen ubicación. Usa Más opciones de asociación para volver a asociarlas.
ja: 選択した写真にはすべて位置があります。「その他の照合オプション」で再照合できます。
ko: 선택한 사진에 모두 위치가 있습니다. 추가 매칭 옵션에서 다시 매칭할 수 있습니다.
pt_br: Todas as fotos selecionadas têm localização. Use Mais opções de associação para associá-las novamente.
zh_hans: 所选照片均已有定位，可在更多匹配选项中重新匹配。
zh_hant: 所選照片均已有定位，可在更多比對選項中重新比對。

# 所选照片的定位
source: Selected Photo Locations
es: Ubicaciones de las fotos seleccionadas
ja: 選択した写真の位置
ko: 선택한 사진의 위치
pt_br: Localizações das fotos selecionadas
zh_hans: 所选照片的定位
zh_hant: 所選照片的定位

# 执行重命名：%1$@ 个文件
source: Rename %1$@ files
es: Renombrar archivos: %1$@
ja: %1$@ ファイルの名前を変更
ko: 파일 %1$@개 이름 변경
pt_br: Renomear arquivos: %1$@
zh_hans: 执行重命名：%1$@ 个文件
zh_hant: 執行重新命名：%1$@ 個檔案

# 拍摄日期＋编号
source: Capture date + number
es: Fecha de captura + número
ja: 撮影日時＋番号
ko: 촬영 날짜 + 번호
pt_br: Data de captura + número
zh_hans: 拍摄日期＋编号
zh_hant: 拍攝日期＋編號

# 按拍摄时间，批量补齐照片定位。
source: Fill in photo locations in batches using capture times.
es: Completa ubicaciones por lotes usando la hora de captura.
ja: 撮影時刻を使って写真の位置をまとめて補完します。
ko: 촬영 시간을 기준으로 사진 위치를 일괄 추가합니다.
pt_br: Preencha localizações em lote usando o horário de captura.
zh_hans: 按拍摄时间，批量补齐照片定位。
zh_hant: 依拍攝時間，批次補齊照片定位。

# 按轨迹时段选择照片
source: Select Photos Within Track Times
es: Seleccionar fotos dentro del horario de la ruta
ja: 軌跡の記録時間内の写真を選択
ko: 경로 시간대의 사진 선택
pt_br: Selecionar fotos no período do trajeto
zh_hans: 按轨迹时段选择照片
zh_hant: 依軌跡時段選擇照片

# 搜索包含全部字段；保留你设置的隐藏与值筛选。
source: Search covers all fields while respecting hidden fields and value filters.
es: La búsqueda abarca todos los campos y respeta los campos ocultos y los filtros de valores.
ja: 検索対象は全フィールドです。非表示設定と値のフィルタは維持されます。
ko: 모든 필드를 검색하며 숨김 설정과 값 필터는 유지합니다.
pt_br: A busca abrange todos os campos e respeita os campos ocultos e os filtros de valores.
zh_hans: 搜索包含全部字段；保留你设置的隐藏与值筛选。
zh_hant: 搜尋包含全部欄位；保留你設定的隱藏與值篩選。

# 收藏当前预览照片的位置
source: Save the current preview photo’s location as a favorite
es: Guardar en favoritos la ubicación de la foto actual
ja: プレビュー中の写真の位置をお気に入りに保存
ko: 미리보기 중인 사진의 위치를 즐겨찾기에 저장
pt_br: Salvar nos favoritos a localização da foto atual
zh_hans: 收藏当前预览照片的位置
zh_hant: 收藏目前預覽照片的位置

# 收起中间结果
source: Hide intermediate results
es: Ocultar resultados intermedios
ja: 中間結果を隠す
ko: 중간 결과 숨기기
pt_br: Ocultar resultados intermediários
zh_hans: 收起中间结果
zh_hant: 收起中間結果

# 收起收藏
source: Show Fewer Favorites
es: Mostrar menos favoritos
ja: お気に入りを一部表示
ko: 즐겨찾기 간략히 보기
pt_br: Mostrar menos favoritos
zh_hans: 收起收藏
zh_hant: 收起收藏

# 收起照片操作
source: Hide photo actions
es: Ocultar acciones de fotos
ja: 写真の操作を隠す
ko: 사진 작업 숨기기
pt_br: Ocultar ações de fotos
zh_hans: 收起照片操作
zh_hant: 收起照片操作

# 新的信息将写入文件，包括照片信息与定位修改，不限当前选中的照片。
source: The new information will be written to the files, including photo information and location changes, not just for the currently selected photos.
es: La información nueva se escribirá en los archivos, incluidos los cambios de información de las fotos y ubicación, no solo en las fotos seleccionadas.
ja: 写真情報と位置情報の変更を含む新しい情報をファイルに書き込みます。現在選択している写真だけが対象ではありません。
ko: 사진 정보와 위치 변경 사항을 포함한 새 정보를 파일에 기록합니다. 현재 선택한 사진에만 적용되는 것은 아닙니다.
pt_br: As novas informações serão gravadas nos arquivos, incluindo alterações nas informações das fotos e na localização, não apenas nas fotos selecionadas.
zh_hans: 新的信息将写入文件，包括照片信息与定位修改，不限当前选中的照片。
zh_hant: 新的資訊將寫入檔案，包括照片資訊與定位修改，不限目前選取的照片。

# 无法读取原轨迹，请重新导入；已有缓存保留。
source: Cannot read the original track. Import it again; the existing cache is kept.
es: No se puede leer el recorrido original. Impórtalo de nuevo; se conserva la caché existente.
ja: 元の軌跡を読み込めません。再度読み込んでください。既存のキャッシュは保持されます。
ko: 원본 경로를 읽을 수 없습니다. 다시 가져오세요. 기존 캐시는 유지됩니다.
pt_br: Não foi possível ler o trajeto original. Importe novamente; o cache existente será mantido.
zh_hans: 无法读取原轨迹，请重新导入；已有缓存保留。
zh_hant: 無法讀取原軌跡，請重新匯入；已有快取保留。

# 更多匹配选项
source: More Matching Options
es: Más opciones de asociación
ja: その他の照合オプション
ko: 추가 매칭 옵션
pt_br: Mais opções de associação
zh_hans: 更多匹配选项
zh_hant: 更多比對選項

# 更多工具
source: More tools
es: Más herramientas
ja: その他のツール
ko: 추가 도구
pt_br: Mais ferramentas
zh_hans: 更多工具
zh_hant: 更多工具

# 有 %1$@ 项未保存修改，包含元数据编辑和地图定位两个页面的修改，不限当前选中照片。保存后将重新生成改名预览，仍需你确认执行；保存失败或取消不会改名。
source: There are %1$@ unsaved items across metadata and map editing, including unselected photos. Saving refreshes the rename preview; you must still confirm renaming. If saving fails or is cancelled, no files are renamed.
es: Hay %1$@ elementos sin guardar de metadatos y mapa, incluidas fotos no seleccionadas. Al guardar se actualizará la vista previa; aún deberás confirmar el cambio de nombres. Si se cancela o falla el guardado, no se renombrará nada.
ja: メタデータと地図に未保存の変更が %1$@ 件あります。選択していない写真も含みます。保存後にプレビューを更新しますが、名前の変更には再度確認が必要です。保存の失敗やキャンセル時には変更しません。
ko: 메타데이터와 지도에 미저장 항목 %1$@개가 있으며 선택하지 않은 사진도 포함됩니다. 저장 후 이름 미리보기가 갱신되며 실행 확인이 다시 필요합니다. 저장 실패 또는 취소 시 이름을 변경하지 않습니다.
pt_br: Há %1$@ itens não salvos de metadados e mapa, incluindo fotos não selecionadas. Salvar atualizará a prévia; ainda será necessário confirmar a renomeação. Se o salvamento falhar ou for cancelado, nada será renomeado.
zh_hans: 有 %1$@ 项未保存修改，包含元数据编辑和地图定位两个页面的修改，不限当前选中照片。保存后将重新生成改名预览，仍需你确认执行；保存失败或取消不会改名。
zh_hant: 有 %1$@ 項未儲存修改，包含中繼資料編輯和地圖定位兩個頁面的修改，不限目前選取的照片。儲存後將重新產生檔名預覽，仍需你確認執行；儲存失敗或取消不會重新命名。

# 本次处理范围
source: Files to process
es: Archivos que se procesarán
ja: 今回の処理対象
ko: 이번 처리 범위
pt_br: Arquivos a processar
zh_hans: 本次处理范围
zh_hant: 本次處理範圍

# 本次已跳过 %1$@ 个不支持的文件。支持导入图片及 GPX、KML、KMZ 轨迹。
source: Skipped unsupported files: %1$@. Images and GPX, KML and KMZ tracks can be imported.
es: Archivos no compatibles omitidos: %1$@. Se pueden importar imágenes y recorridos GPX, KML y KMZ.
ja: 未対応ファイル %1$@ 件をスキップしました。画像と GPX・KML・KMZ の軌跡を読み込めます。
ko: 지원하지 않는 파일 %1$@개를 건너뛰었습니다. 이미지와 GPX, KML, KMZ 경로를 가져올 수 있습니다.
pt_br: Arquivos incompatíveis ignorados: %1$@. É possível importar imagens e trajetos GPX, KML e KMZ.
zh_hans: 本次已跳过 %1$@ 个不支持的文件。支持导入图片及 GPX、KML、KMZ 轨迹。
zh_hant: 本次已略過 %1$@ 個不支援的檔案。支援匯入圖片及 GPX、KML、KMZ 軌跡。

# 查找并替换
source: Find and replace
es: Buscar y reemplazar
ja: 検索と置換
ko: 찾기 및 바꾸기
pt_br: Localizar e substituir
zh_hans: 查找并替换
zh_hant: 尋找並取代

# 查看全部收藏
source: Show All Favorites
es: Ver todos los favoritos
ja: すべてのお気に入りを表示
ko: 모든 즐겨찾기 보기
pt_br: Ver todos os favoritos
zh_hans: 查看全部收藏
zh_hant: 查看全部收藏

# 正在保存
source: Saving
es: Guardando
ja: 保存中
ko: 저장 중
pt_br: Salvando
zh_hans: 正在保存
zh_hant: 正在儲存

# 清除搜索
source: Clear search
es: Borrar búsqueda
ja: 検索をクリア
ko: 검색 지우기
pt_br: Limpar busca
zh_hans: 清除搜索
zh_hant: 清除搜尋

# 点名称查看，点应用修改所选照片。
source: Click a name to view it; Apply changes the selected photos.
es: Haz clic en el nombre para ver el lugar; Aplicar modifica las fotos seleccionadas.
ja: 名前で場所を表示し、適用で選択した写真を変更します。
ko: 이름을 클릭하면 위치를 보고, 적용을 클릭하면 선택한 사진을 변경합니다.
pt_br: Clique no nome para ver o local; Aplicar altera as fotos selecionadas.
zh_hans: 点名称查看，点应用修改所选照片。
zh_hant: 點名稱查看，點套用修改所選照片。

# 照片定位
source: Photo Location
es: Ubicación de fotos
ja: 写真の位置情報
ko: 사진 위치
pt_br: Localização das fotos
zh_hans: 照片定位
zh_hant: 照片定位

# 照片操作
source: Photo actions
es: Acciones de fotos
ja: 写真の操作
ko: 사진 작업
pt_br: Ações de fotos
zh_hans: 照片操作
zh_hant: 照片操作

# 照片范围
source: Photo scope
es: Alcance de fotos
ja: 写真の範囲
ko: 사진 범위
pt_br: Escopo das fotos
zh_hans: 照片范围
zh_hant: 照片範圍

# 照片：%1$@ · 额外文件：%2$@；配对文件一并列入右侧预览。
source: Photos: %1$@ · Extra files: %2$@. Paired files are also included in the preview.
es: Fotos: %1$@ · Archivos adicionales: %2$@. Los archivos emparejados también aparecen en la vista previa.
ja: 写真：%1$@・追加ファイル：%2$@。ペアのファイルも右側のプレビューに含まれます。
ko: 사진: %1$@ · 추가 파일: %2$@. 연결된 파일도 오른쪽 미리보기에 포함됩니다.
pt_br: Fotos: %1$@ · Arquivos extras: %2$@. Os arquivos pareados também aparecem na prévia.
zh_hans: 照片：%1$@ · 额外文件：%2$@；配对文件一并列入右侧预览。
zh_hant: 照片：%1$@ · 額外檔案：%2$@；配對檔案一併列入右側預覽。

# 第 %1$@ 条执行后
source: After rule %1$@
es: Tras la regla %1$@
ja: ルール %1$@ の適用後
ko: 규칙 %1$@ 적용 후
pt_br: Após a regra %1$@
zh_hans: 第 %1$@ 条执行后
zh_hant: 第 %1$@ 條執行後

# 筛选（%1$@）
source: Filters (%1$@)
es: Filtros (%1$@)
ja: フィルタ（%1$@）
ko: 필터 (%1$@)
pt_br: Filtros (%1$@)
zh_hans: 筛选（%1$@）
zh_hant: 篩選（%1$@）

# 编辑所选字段
source: Edit selected fields
es: Editar campos seleccionados
ja: 選択したフィールドを編集
ko: 선택한 필드 편집
pt_br: Editar campos selecionados
zh_hans: 编辑所选字段
zh_hant: 編輯所選欄位

# 自定义规则
source: Custom rules
es: Reglas personalizadas
ja: カスタムルール
ko: 사용자 지정 규칙
pt_br: Regras personalizadas
zh_hans: 自定义规则
zh_hant: 自訂規則

# 设置已就绪，可以编辑照片信息、添加地点或整理文件名。
source: You're ready to edit photo information, add locations, or organize filenames.
es: Todo listo para editar información, añadir ubicaciones u organizar nombres de archivo.
ja: 写真情報の編集、場所の追加、ファイル名の整理を始められます。
ko: 사진 정보 편집, 위치 추가, 파일명 정리를 시작할 준비가 되었습니다.
pt_br: Tudo pronto para editar informações, adicionar locais ou organizar nomes de arquivo.
zh_hans: 设置已就绪，可以编辑照片信息、添加地点或整理文件名。
zh_hant: 設定已就緒，可以編輯照片資訊、新增地點或整理檔名。

# 轨迹与隐私说明
source: Tracks and Privacy
es: Rutas y privacidad
ja: 軌跡とプライバシー
ko: 경로 및 개인정보 안내
pt_br: Trajetos e privacidade
zh_hans: 轨迹与隐私说明
zh_hant: 軌跡與隱私說明

# 轨迹历史
source: Track History
es: Historial de rutas
ja: 軌跡の履歴
ko: 경로 기록
pt_br: Histórico de trajetos
zh_hans: 轨迹历史
zh_hant: 軌跡歷史

# 轨迹记录时间，按本机时区显示
source: Track recording time, shown in this Mac’s time zone
es: Hora del recorrido, en la zona horaria de este Mac
ja: 軌跡の記録時刻（この Mac のタイムゾーン）
ko: 이 Mac의 시간대로 표시한 경로 기록 시간
pt_br: Horário do trajeto no fuso deste Mac
zh_hans: 轨迹记录时间，按本机时区显示
zh_hant: 軌跡記錄時間，按本機時區顯示
